# Задача 1
# На вход подаются три числа. Выведите их сумму

a, b, c = int(input()), int(input()), int(input())
print(a + b + c)